; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	thermograph0 - mode
	infrared2 - mode
	infrared5 - mode
	infrared1 - mode
	infrared6 - mode
	spectrograph4 - mode
	thermograph3 - mode
	Star4 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star2 - direction
	Star7 - direction
	Star8 - direction
	Star1 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared5)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 infrared5)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star7)
	(supports instrument4 infrared6)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument5 infrared5)
	(supports instrument5 spectrograph4)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(pointing satellite1 Star2)
	(pointing satellite2 Star2)
	(have_image Phenomenon9 infrared6)
	(have_image Phenomenon9 spectrograph4)
	(have_image Planet10 infrared6)
	(have_image Planet10 thermograph3)
	(have_image Star11 infrared6)
	(have_image Phenomenon12 thermograph3)
	(have_image Phenomenon12 infrared6)
	(have_image Phenomenon13 infrared5)
))

)

; plan
1. (turn_to satellite2 groundstation0 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 11
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 11
3. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 11
4. (turn_to satellite2 phenomenon13 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon13)
   goals met: 0 of 11
5. (take_image satellite2 phenomenon13 instrument5 infrared5)
   added: (have_image phenomenon13 infrared5)
   goals met: 1 of 11
6. (turn_to satellite2 phenomenon12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon12)
   goals met: 1 of 11
7. (turn_to satellite1 groundstation0 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 11
8. (take_image satellite2 phenomenon12 instrument5 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 2 of 11
9. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 11
10. (calibrate satellite1 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 2 of 11
11. (turn_to satellite0 groundstation6 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation6)
   goals met: 3 of 11
12. (turn_to satellite1 phenomenon12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 11
13. (take_image satellite1 phenomenon12 instrument4 infrared6)
   added: (have_image phenomenon12 infrared6)
   goals met: 4 of 11
14. (turn_to satellite1 phenomenon9 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 11
15. (take_image satellite1 phenomenon9 instrument4 infrared6)
   added: (have_image phenomenon9 infrared6)
   goals met: 5 of 11
16. (turn_to satellite1 planet10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet10)
   goals met: 5 of 11
17. (take_image satellite1 planet10 instrument4 infrared6)
   added: (have_image planet10 infrared6)
   goals met: 6 of 11
18. (turn_to satellite1 star11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star11)
   goals met: 6 of 11
19. (take_image satellite1 star11 instrument4 infrared6)
   added: (have_image star11 infrared6)
   goals met: 7 of 11
20. (turn_to satellite1 star2 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star2)
   goals met: 8 of 11
21. (turn_to satellite2 phenomenon9 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon9)
   goals met: 8 of 11
22. (take_image satellite2 phenomenon9 instrument5 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 9 of 11
23. (turn_to satellite2 planet10 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet10)
   goals met: 9 of 11
24. (take_image satellite2 planet10 instrument5 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 10 of 11
25. (turn_to satellite2 star2 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star2)
   goals met: 11 of 11
